SELECT COUNT(avg_rating)

FROM (SELECT AVG(CAST("Н_ОЦЕНКИ"."КОД" AS INTEGER)) AS "avg_rating"
      FROM "Н_УЧЕНИКИ"
               JOIN
           "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
               LEFT JOIN
           "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
               LEFT JOIN
           "Н_ОЦЕНКИ" ON "Н_ВЕДОМОСТИ"."ОЦЕНКА" = "Н_ОЦЕНКИ"."КОД"
               LEFT JOIN
           "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
               LEFT JOIN
           "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
      WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ' -- с ФКТИУ нет результатов
        AND "Н_ОЦЕНКИ"."КОД" IN ('5', '4', '3', '2')
      GROUP BY "Н_ЛЮДИ"."ИД"
      HAVING AVG(CAST("Н_ОЦЕНКИ"."КОД" AS INTEGER)) >= 3.5) as grades;