SELECT "Н_УЧЕНИКИ"."ГРУППА",
       "Н_УЧЕНИКИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_УЧЕНИКИ"."ПРИЗНАК",
       "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ"

from "Н_УЧЕНИКИ"
         LEFT JOIN
     "Н_ОБУЧЕНИЯ" ON "Н_УЧЕНИКИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         LEFT JOIN
     "Н_ЛЮДИ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         LEFT JOIN
     "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         LEFT JOIN
     "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
WHERE                                    -- очная и заочная => все
    "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" IS NOT NULL
  AND "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ' -- Программная инженерия нет
  AND "Н_УЧЕНИКИ"."ИД" IN (SELECT "ИД"
                           FROM "Н_УЧЕНИКИ"
                           WHERE "ПРИЗНАК" = 'отчисл'
                             AND "КОНЕЦ" > DATE '2012-09-01')