SELECT "Н_ЛЮДИ"."ОТЧЕСТВО",
       COUNT("Н_ЛЮДИ"."ИД") AS "количество_людей"
FROM "Н_ЛЮДИ"
         LEFT JOIN
     "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         LEFT JOIN
     "Н_УЧЕНИКИ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
         LEFT JOIN
     "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         LEFT JOIN
     "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ' -- с ФКТИУ нет результатов
  AND "Н_ЛЮДИ"."ОТЧЕСТВО" IN (SELECT "Н_ЛЮДИ"."ОТЧЕСТВО"
                              FROM "Н_ЛЮДИ"
                                       LEFT JOIN
                                   "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
                              WHERE "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" IS NULL
                                AND "Н_ЛЮДИ"."ОТЧЕСТВО" IS NOT NULL
                              GROUP BY "Н_ЛЮДИ"."ОТЧЕСТВО") -- отчества преподов
GROUP BY "Н_ЛЮДИ"."ОТЧЕСТВО"
HAVING COUNT("Н_ЛЮДИ"."ИД") < 50;