-- Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
-- Таблицы: Н_ЛЮДИ, Н_ОБУЧЕНИЯ, Н_УЧЕНИКИ.
-- Вывести атрибуты: Н_ЛЮДИ.ИД, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ГРУППА.
-- Фильтры: (AND)
-- a) Н_ЛЮДИ.ФАМИЛИЯ < Ёлкин.
-- b) Н_ОБУЧЕНИЯ.ЧЛВК_ИД < 163276.
-- c) Н_УЧЕНИКИ.ГРУППА = 1100.
-- Вид соединения: LEFT JOIN.

CREATE INDEX idx_люди_фамилия ON public."Н_ЛЮДИ" ("ФАМИЛИЯ");
CREATE INDEX idx_обучения_члвк_id ON public."Н_ОБУЧЕНИЯ" ("ЧЛВК_ИД");
CREATE INDEX idx_ученики_группа_int ON public."Н_УЧЕНИКИ" (("ГРУППА"::integer));

EXPLAIN ANALYZE
SELECT
    "Н_ЛЮДИ"."ИД",
    "Н_ОБУЧЕНИЯ"."НЗК",
    "Н_УЧЕНИКИ"."ГРУППА"
FROM
    "Н_ЛЮДИ"
        LEFT JOIN
    "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
        LEFT JOIN
    "Н_УЧЕНИКИ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД" and "Н_ОБУЧЕНИЯ"."ВИД_ОБУЧ_ИД" = "Н_УЧЕНИКИ"."ВИД_ОБУЧ_ИД"
WHERE
    "Н_ЛЮДИ"."ФАМИЛИЯ" < 'Ёлкин'
  AND "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" < 163276
  AND CAST("Н_УЧЕНИКИ"."ГРУППА" AS INTEGER) = 1100;



select count(1) from "Н_УЧЕНИКИ" where CAST("Н_УЧЕНИКИ"."ГРУППА" AS INTEGER) = 1100;  --1468 строк
select count(1) from "Н_ОБУЧЕНИЯ" where "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" < 163276;  --5019 строк
select count(1) from "Н_ЛЮДИ" where "Н_ЛЮДИ"."ФАМИЛИЯ" < 'Ёлкин';  --1340 строк
