tests = [
    ['Григорьев А.М. P3103', 'Орлов О.Н. P3103', 'Григорьев Д.М. P3103', 'Орлов Д.А. P3103', 'Сергеев С.А. P3107',
     'Григорьев С.А. P3103', 'Дмитриев Н.А. P3103', 'Дмитриев О.В. P3107', 'Михайлов А.И. P3107', 'Ковалев С.В. P3107',
     'Ковалев Е.С. P3103', 'Степанов Е.А. P3107', 'Романов А.Е. P3107', 'Федоров А.В. P3107', 'Романов С.В. P3103',
     'Андреев Е.А. P3103', 'Смирнов Д.А. P3103', 'Васильев О.В. P3107', 'Васильев С.В. P3103', 'Петров Д.В. P3103'],
    ['Орлов А.И. P3107', 'Смирнов А.Е. P3107', 'Дмитриев И.А. P3103', 'Алексеев И.М. P3107', 'Романов И.М. P3107',
     'Павлов Н.А. P3103', 'Федоров А.Е. P3107', 'Федоров Д.А. P3107', 'Григорьев Н.А. P3107', 'Павлов А.Н. P3103',
     'Андреев Н.В. P3103', 'Дмитриев А.И. P3103', 'Никитин А.Е. P3103', 'Иванов И.Н. P3103', 'Иванов Н.В. P3103',
     'Орлов И.Н. P3107', 'Михайлов О.В. P3103', 'Михайлов Н.С. P3103', 'Васильев Д.А. P3103', 'Алексеев А.Н. P3103'],
    ['Андреев О.В. P3107', 'Никитин С.А. P3107', 'Степанов И.Н. P3107', 'Иванов Д.В. P3103', 'Сергеев Н.В. P3103',
     'Павлов О.А. P3107', 'Сидоров Е.А. P3107', 'Петров А.С. P3103', 'Романов С.А. P3103', 'Смирнов Н.А. P3103',
     'Смирнов А.М. P3107', 'Никитин А.М. P3107', 'Андреев Д.С. P3107', 'Борисов А.Е. P3107', 'Сергеев А.И. P3103',
     'Федоров И.Н. P3107', 'Павлов Д.С. P3103', 'Дмитриев Е.А. P3103', 'Степанов А.И. P3103', 'Григорьев С.В. P3103'],
    ['Михайлов Н.А. P3107', 'Борисов С.В. P3107', 'Иванов А.Д. P3107', 'Борисов А.И. P3107', 'Павлов А.И. P3107',
     'Ковалев И.А. P3107', 'Васильев А.Н. P3107', 'Орлов Д.С. P3103', 'Васильев А.М. P3103', 'Ковалев Е.А. P3107',
     'Алексеев С.А. P3107', 'Алексеев Д.С. P3103', 'Андреев И.М. P3103', 'Никитин И.М. P3103', 'Романов Н.В. P3103',
     'Сергеев Д.С. P3103', 'Степанов Е.С. P3103', 'Андреев А.Н. P3103', 'Иванов С.А. P3103', 'Васильев Е.С. P3107'],
    ['Романов Е.С. P3103', 'Степанов И.М. P3107', 'Дмитриев И.М. P3103', 'Ковалев Н.В. P3107', 'Сергеев А.Е. P3103',
     'Попов О.В. P3103', 'Михайлов Д.С. P3103', 'Смирнов Е.С. P3103', 'Иванов Е.А. P3103', 'Борисов И.М. P3107',
     'Кузнецов И.Н. P3107', 'Федоров Е.А. P3103', 'Сергеев И.М. P3103', 'Алексеев С.В. P3107', 'Борисов Н.В. P3107',
     'Никитин Е.С. P3107', 'Павлов Д.А. P3107', 'Алексеев Е.В. P3103', 'Иванов С.В. P3103', 'Николаев Е.В. P3103']

]

answers = [
    ['Григорьев А.М. P3103', 'Орлов О.Н. P3103', 'Григорьев Д.М. P3103', 'Орлов Д.А. P3103', 'Григорьев С.А. P3103',
     'Дмитриев Н.А. P3103', 'Дмитриев О.В. P3107', 'Михайлов А.И. P3107', 'Ковалев С.В. P3107', 'Ковалев Е.С. P3103',
     'Романов А.Е. P3107', 'Федоров А.В. P3107', 'Романов С.В. P3103', 'Андреев Е.А. P3103', 'Смирнов Д.А. P3103',
     'Васильев О.В. P3107', 'Васильев С.В. P3103', 'Петров Д.В. P3103'],
    ['Смирнов А.Е. P3107', 'Дмитриев И.А. P3103', 'Алексеев И.М. P3107', 'Романов И.М. P3107', 'Павлов Н.А. P3103',
     'Григорьев Н.А. P3107', 'Павлов А.Н. P3103', 'Андреев Н.В. P3103', 'Дмитриев А.И. P3103', 'Никитин А.Е. P3103',
     'Иванов И.Н. P3103', 'Иванов Н.В. P3103', 'Михайлов О.В. P3103', 'Михайлов Н.С. P3103', 'Васильев Д.А. P3103',
     'Алексеев А.Н. P3103'],
    ['Иванов Д.В. P3103', 'Сергеев Н.В. P3103', 'Павлов О.А. P3107', 'Петров А.С. P3103', 'Романов С.А. P3103',
     'Смирнов Н.А. P3103', 'Борисов А.Е. P3107', 'Сергеев А.И. P3103', 'Федоров И.Н. P3107', 'Павлов Д.С. P3103',
     'Дмитриев Е.А. P3103', 'Степанов А.И. P3103', 'Григорьев С.В. P3103'],
    ['Михайлов Н.А. P3107', 'Иванов А.Д. P3107', 'Павлов А.И. P3107', 'Васильев А.Н. P3107', 'Орлов Д.С. P3103',
     'Васильев А.М. P3103', 'Алексеев С.А. P3107', 'Алексеев Д.С. P3103', 'Андреев И.М. P3103', 'Никитин И.М. P3103',
     'Романов Н.В. P3103', 'Сергеев Д.С. P3103', 'Степанов Е.С. P3103', 'Андреев А.Н. P3103', 'Иванов С.А. P3103',
     'Васильев Е.С. P3107'],
    ['Романов Е.С. P3103', 'Степанов И.М. P3107', 'Дмитриев И.М. P3103', 'Сергеев А.Е. P3103', 'Попов О.В. P3103',
     'Михайлов Д.С. P3103', 'Смирнов Е.С. P3103', 'Иванов Е.А. P3103', 'Федоров Е.А. P3103', 'Сергеев И.М. P3103',
     'Алексеев С.В. P3107', 'Никитин Е.С. P3107', 'Павлов Д.А. P3107', 'Алексеев Е.В. P3103', 'Иванов С.В. P3103',
     'Николаев Е.В. P3103'],

    ]

num_tests = 5
