tests = [
    "Студент Вася вспомнил, что на своей лекции Балакшин П.В. упоминал про старшекурсников, которые будут ему помогать:"
    " Анищенко А.А., Машина Е.А. и Голованова-Иванова Д.В.",
    "Вчера на конференции присутствовали многие известные ученые. Петров А.А. рассказал о своих исследованиях в области"
    " компьютерного зрения, в то время как Иванов И.И. представил свою работу по обработке естественного языка. "
    "Смирнова Н.Н. поделилась своими результатами в области робототехники.",
    "В университете прошла встреча с известным писателем, Тихоновым Т.Т. Он прочитал лекцию о современной литературе и "
    "ответил на вопросы студентов. Также на встрече присутствовали преподаватели, Тихонов Т.Т. поделился своим "
    "опытом работы над романами и рассказами, а Морозов М.М. и Орлов О.О. обсудили важность литературы в современном "
    "обществе.",
    "Компания \"Электроника\" объявила о назначении нового генерального директора, Фролова Ф.Ф. Он сменил на посту "
    "генерального директора предыдущего руководителя, Гусева Г.Г. Также в компании работает команда опытных "
    "специалистов, включая Денисова Д.Д. и Егорова Е.Е.",
    "На прошлой неделе в городе состоялся фестиваль классической музыки, в котором приняли участие многие известные "
    "музыканты, включая скрипача, Романова Р.Р., и пианиста, Савельева С.С. Они исполнили произведения известных "
    "композиторов, включая Моцарта и Чайковского. Также на фестивале присутствовали музыкальные критики, включая "
    "Тарасова Т.Т. и Устинова У.У. Музыканты получили высокую оценку за свои выступления.",
]

answers = [['Анищенко', 'Балакшин', 'Голованова-Иванова', 'Машина'],
           ['Иванов', 'Петров', 'Смирнова'],
           ['Морозов', 'Орлов', 'Тихонов', 'Тихоновым'],
           ['Гусева', 'Денисова', 'Егорова', 'Фролова'],
           ['Романова', 'Савельева', 'Тарасова', 'Устинова'],
           ]

num_tests = 5
